# GetObjStoryBoundsCnt

## Description
Return the number of story bounds defined for this object.

```pascal
FUNCTION GetObjStoryBoundsCnt(object : HANDLE) : INTEGER;
```

```python

def vs.GetObjStoryBoundsCnt(object):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object.|

## Returns
The number of story bounds for this object.

## See Also
VS Functions:
HasObjStoryBounds| HasObjStoryBound| GetObjStoryBound| SetObjectStoryBound| DelObjStoryBounds| DelObjStoryBound| GetObjStoryBoundsCnt| GetObjStoryBoundsAt

## Version
Availability: from Vectorworks 2012
## Category
* Objects - Architectural